# Project 3 - Part 3 (Core)

- Part 3: Construct and export a MySQL database using your data.

In [263]:
import os
os.makedirs('Data/',exist_ok=True) 
os.listdir('Data')

['.ipynb_checkpoints',
 'final_DF.csv.gz',
 'final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'title_akas.csv.gz',
 'title_basics.csv.gz',
 'title_ratings.csv.gz']

In [264]:
import pandas as pd

# Required Transformation Steps for Title Basics:

- Normalize Genre:

Convert the single string of genres from title basics into 2 new tables.
1. title_genres: with the columns:

    - tconst
    - genre_id
2. genres:

    - genre_id
    - genre_name

In [265]:
df = pd.read_csv('Data/title_basics.csv.gz', low_memory=False)
df.head()

      tconst titleType                                       primaryTitle                              originalTitle  isAdult  startYear  endYear  runtimeMinutes                  genres
0  tt0035423     movie                                     Kate & Leopold                             Kate & Leopold        0     2001.0      NaN             118  Comedy,Fantasy,Romance
1  tt0062336     movie  The Tango of the Widower and Its Distorting Mi...  El tango del viudo y su espejo deformante        0     2020.0      NaN              70                   Drama
2  tt0068865     movie                                Lives of Performers                        Lives of Performers        0     2016.0      NaN              90                   Drama
3  tt0069049     movie                         The Other Side of the Wind                 The Other Side of the Wind        0     2018.0      NaN             122                   Drama
4  tt0088751     movie                                  The Naked Monster                          The Naked Monster        0     2005.0      NaN             100    Comedy,Horror,Sci-Fi

In [266]:
df['genres_split'] = df['genres'].str.split(',')
df

exploded_genres = df.explode('genres_split')
exploded_genres

          tconst titleType                                       primaryTitle                              originalTitle  isAdult  startYear  endYear  runtimeMinutes                     genres genres_split
0      tt0035423     movie                                     Kate & Leopold                             Kate & Leopold        0     2001.0      NaN             118     Comedy,Fantasy,Romance       Comedy
0      tt0035423     movie                                     Kate & Leopold                             Kate & Leopold        0     2001.0      NaN             118     Comedy,Fantasy,Romance      Fantasy
0      tt0035423     movie                                     Kate & Leopold                             Kate & Leopold        0     2001.0      NaN             118     Comedy,Fantasy,Romance      Romance
1      tt0062336     movie  The Tango of the Widower and Its Distorting Mi...  El tango del viudo y su espejo deformante        0     2020.0      NaN              70                      Drama        Drama
2      tt0068865     movie                                Lives of Performers                        Lives of Performers        0     2016.0      NaN              90                      Drama        Drama
...          ...       ...                                                ...                                        ...      ...        ...      ...             ...                        ...          ...
82003  tt9916190     movie                                          Safeguard                                  Safeguard        0     2020.0      NaN              95  Action,Adventure,Thriller       Action
82003  tt9916190     movie                                          Safeguard                                  Safeguard        0     2020.0      NaN              95  Action,Adventure,Thriller    Adventure
82003  tt9916190     movie                                          Safeguard                                  Safeguard        0     2020.0      NaN              95  Action,Adventure,Thriller     Thriller
82004  tt9916362     movie                                              Coven                                   Akelarre        0     2020.0      NaN              92              Drama,History        Drama
82004  tt9916362     movie                                              Coven                                   Akelarre        0     2020.0      NaN              92              Drama,History      History

[153827 rows x 10 columns]

In [267]:

genres_split=df['genres_split']
unique_genres=genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Biography', 'Mystery', 'Musical', 'Action', 'Adventure', 'Crime',
       'Thriller', 'Music', 'Animation', 'Family', 'History', 'War',
       'Sport', 'Western', 'Adult', 'Reality-TV', 'News', 'Talk-Show',
       'Game-Show'], dtype=object)

In [268]:

title_genres=exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [269]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Comedy': 0,
 'Fantasy': 1,
 'Romance': 2,
 'Drama': 3,
 'Horror': 4,
 'Sci-Fi': 5,
 'Biography': 6,
 'Mystery': 7,
 'Musical': 8,
 'Action': 9,
 'Adventure': 10,
 'Crime': 11,
 'Thriller': 12,
 'Music': 13,
 'Animation': 14,
 'Family': 15,
 'History': 16,
 'War': 17,
 'Sport': 18,
 'Western': 19,
 'Adult': 20,
 'Reality-TV': 21,
 'News': 22,
 'Talk-Show': 23,
 'Game-Show': 24}

In [270]:
title_genres['genre_id'] = title_genres['genres_split'].replace(genre_map)
title_genres['genre_name']=title_genres['genres_split']
title_genres=title_genres.drop(columns=['genres_split','tconst'])

In [271]:
title_genres.head()

   genre_id genre_name
0         0     Comedy
0         1    Fantasy
0         2    Romance
1         3      Drama
2         3      Drama

In [274]:
genre_lookup=pd.DataFrame({'genre_name':genre_id_map.keys(),
                          'genre_id':genre_id_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4